jobs/20260721-124503-luqia-vllm-scheduler-pd/scheduler_pd_results/bench.txt
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x719e8208d120>, seed=0, num_prompts=16, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=512, random_output_len=64, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://10.1.0.3:30104', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=4, model='mistralai/Mistral-7B-v0.1', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=2, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-2fe24c37-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 07-21 13:50:11 [datasets.py:612] Sampling input_len from [511, 511] and output_len from [64, 64]
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:04<00:00,  2.14s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
100%|██████████| 16/16 [00:21<00:00,  1.33s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     16        
Failed requests:                         0         
Maximum request concurrency:             4         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  21.32     
Total input tokens:                      8176      
Total generated tokens:                  1024      
Request throughput (req/s):              0.75      
Output token throughput (tok/s):         48.03     
Peak output token throughput (tok/s):    64.00     
Peak concurrent requests:                6.00      
Total token throughput (tok/s):          431.54    
---------------Time to First Token----------------
Mean TTFT (ms):                          351.45    
Median TTFT (ms):                        371.19    
P99 TTFT (ms):                           378.97    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          62.56     
Median TPOT (ms):                        62.65     
P99 TPOT (ms):                           63.03     
---------------Inter-token Latency----------------
Mean ITL (ms):                           62.56     
Median ITL (ms):                         62.74     
P99 ITL (ms):                            71.60     
==================================================